Ran Plan for dir: `infra/terraform/env/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # azurerm_container_app.frontend will be updated in-place
~ resource "azurerm_container_app" "frontend" {
        id                            = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.App/containerApps/ca-frontend"
        name                          = "ca-frontend"
        tags                          = {}
      - workload_profile_name         = "Consumption" -> null
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_key_vault.shared will be created
+ resource "azurerm_key_vault" "shared" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "koreacentral"
      + name                          = "kv-stocklens-dev-0419"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-stocklens-msa"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "3c7af54b-0441-48d3-9109-04fcf1bb64e3"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.postgres_admin_password will be created
+ resource "azurerm_key_vault_secret" "postgres_admin_password" {
      + content_type            = "password"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgres-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.postgres will be destroyed
  # (because azurerm_postgresql_flexible_server.postgres is not in configuration)
- resource "azurerm_postgresql_flexible_server" "postgres" {
      - administrator_login           = "stocklensadmin" -> null
      - administrator_password        = (sensitive value) -> null
      - auto_grow_enabled             = false -> null
      - backup_retention_days         = 7 -> null
      - fqdn                          = "psql-stocklens-dev-yslee0419.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled  = false -> null
      - id                            = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419" -> null
      - location                      = "koreacentral" -> null
      - name                          = "psql-stocklens-dev-yslee0419" -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "rg-stocklens-msa" -> null
      - sku_name                      = "B_Standard_B1ms" -> null
      - storage_mb                    = 32768 -> null
      - storage_tier                  = "P4" -> null
      - tags                          = {} -> null
      - version                       = "16" -> null
      - zone                          = "1" -> null
        # (3 unchanged attributes hidden)

      - authentication {
          - active_directory_auth_enabled = false -> null
          - password_auth_enabled         = true -> null
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_postgresql_flexible_server_database.databases["auth"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.databases is not in configuration)
- resource "azurerm_postgresql_flexible_server_database" "databases" {
      - charset   = "UTF8" -> null
      - collation = "en_US.utf8" -> null
      - id        = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419/databases/authdb" -> null
      - name      = "authdb" -> null
      - server_id = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419" -> null
    }

  # azurerm_postgresql_flexible_server_database.databases["news"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.databases is not in configuration)
- resource "azurerm_postgresql_flexible_server_database" "databases" {
      - charset   = "UTF8" -> null
      - collation = "en_US.utf8" -> null
      - id        = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419/databases/newsdb" -> null
      - name      = "newsdb" -> null
      - server_id = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419" -> null
    }

  # azurerm_postgresql_flexible_server_database.databases["stock"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.databases is not in configuration)
- resource "azurerm_postgresql_flexible_server_database" "databases" {
      - charset   = "UTF8" -> null
      - collation = "en_US.utf8" -> null
      - id        = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419/databases/stockdb" -> null
      - name      = "stockdb" -> null
      - server_id = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-stocklens-dev-yslee0419" -> null
    }

  # azurerm_redis_cache.auth will be destroyed
  # (because azurerm_redis_cache.auth is not in configuration)
- resource "azurerm_redis_cache" "auth" {
      - capacity                      = 0 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "C" -> null
      - hostname                      = "redis-stocklens-dev.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.Cache/redis/redis-stocklens-dev" -> null
      - location                      = "koreacentral" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "redis-stocklens-dev" -> null
      - non_ssl_port_enabled          = false -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value) -> null
      - primary_connection_string     = (sensitive value) -> null
      - public_network_access_enabled = true -> null
      - redis_version                 = "6.0" -> null
      - replicas_per_master           = 0 -> null
      - replicas_per_primary          = 0 -> null
      - resource_group_name           = "rg-stocklens-msa" -> null
      - secondary_access_key          = (sensitive value) -> null
      - secondary_connection_string   = (sensitive value) -> null
      - shard_count                   = 0 -> null
      - sku_name                      = "Standard" -> null
      - ssl_port                      = 6380 -> null
      - tags                          = {} -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (2 unchanged attributes hidden)

      - redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          - authentication_enabled                  = true -> null
          - enable_authentication                   = true -> null
          - maxclients                              = 256 -> null
          - maxfragmentationmemory_reserved         = 30 -> null
          - maxmemory_delta                         = 30 -> null
          - maxmemory_reserved                      = 30 -> null
          - rdb_backup_enabled                      = false -> null
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (7 unchanged attributes hidden)
        }
    }

  # random_password.postgres_admin will be created
+ resource "random_password" "postgres_admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!@#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 3 to add, 1 to change, 5 to destroy.

Changes to Outputs:
- auth_db_name                        = "authdb" -> null
~ key_vault_id                        = "/subscriptions/68b82d8c-9e8e-4520-85d5-a88315709b99/resourceGroups/rg-stocklens-msa/providers/Microsoft.KeyVault/vaults/kv-stocklens-dev-0419" -> (known after apply)
- news_db_name                        = "newsdb" -> null
- postgres_fqdn                       = "psql-stocklens-dev-yslee0419.postgres.database.azure.com" -> null
- postgres_port                       = 5432 -> null
- redis_hostname                      = "redis-stocklens-dev.redis.cache.windows.net" -> null
- redis_ssl_port                      = 6380 -> null
- stock_db_name                       = "stockdb" -> null
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/terraform/env/dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://SandboxHost-639097491906805074:4141/lock?id=Takaluk%252Fatlantis-azure-devsecops%252Finfra%252Fterraform%252Fenv%252Fdev%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/terraform/env/dev
  ```
Plan: 3 to add, 1 to change, 5 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```